using System;

// Сергей Иванов
// Задание 4.4
// Решить задачу с логинами из урока 2,
// только логины и пароли считать из файла в массив. 
// Создайте структуру Account, содержащую Login и Password.

namespace _4_4_LoginFromFile
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
